"providerDisplayName" = "Weather Asst";
"providerDescription" = "Search local weather for any city.";
"lang" = "en";
"direction" = "direction";
"humidity" = "humidity";
"sunrise" = "sunrise";
"sunset" = "sunset";

"null" = "- -";

"not available" = "not available";

"无对应的天气结果" = "No corresponded weather result";
"回车后进入雅虎天气进行查询" = "Return to visit Yahoo Weather";
"http://hk.weather.yahoo.com/" = "http://weather.yahoo.com/";

"Are you sure to delete all regions" = "Are you sure to delete all regions";
"After delete all regions, weather widget will be closed." = "After delete all regions, weather widget will be closed.";
"OK" = "OK";
"Cancel" = "Cancel";
"The number of city has reached the limit." = "The number of city has reached the limit.";